# St7SetTransientTemperatureInputType

Sets the type of temperature data to be used for quasi-static and nonlinear transient dynamic analysis.

long St7SetTransientTemperatureInputType(long uID, long InputType)
Input Parameters
uID
Strand7 model file ID.
InputType
Temperature type; either ttFromFile or ttNodalTemp.